_posts/technology/2023-05-01-secs-sem-standard.html
---
layout: post
title: SECS/SEM 半导体行业的工厂通信标准
categories: [technology]
tags: [[industry]]
---
<p>
不同的工业行业，都有数字化通信的需求。但是在发展之初，跨行业的沟通很少，于是各行各业各自自行制定了各种不同的网络通信标准。比如之前介绍的注塑机和 MES 通信的标准 <a href="http://kimi.im/2022-07-09-euromap77">EUROMAP 77</a>。
</p>

<p>
同样的，在半导体行业，也有行业通行的通信标准，名叫 SECS/GEM。这个标准是用于工厂主机系统（Factory Host System）和工业设备（ Equipment ）之间的通信。
</p>

<p>
半导体设备发送数据、状态、事件、警报等信息给工厂主机系统，工厂就可以通过工厂主机系统全方位监视和控制设备，实现生产的全自动化。
</p>

<p>
那么为什么这个标准叫这个奇奇怪怪的名字：SECS/GEM？
</p>

<p>
SECS 的全称是Semiconductor Equipment Communication Standard。就是半导体设备通信标准。而 GEM的全称则是Generic Equipment Model通用设备模型。工厂用来指导生产过程的 MES 系统，就可以通过这个通信和模型标准，来跟设备进行顺畅通信了。
</p>

<p>
SECS/GEM 是一伙从事半导体行业的公司一起维护的标准。这样，大家开发的设备和软件互相通信就不会出现鸡同鸭讲的问题了。
</p>

<p>
需要用到SECS/GEM的公司都有哪些呢？他们分别是：
</p>
<ul class="org-ul">
<li>做半导体生产设备的设备厂商</li>
<li>从事半导体生产的，半导体制造厂，晶圆制造厂</li>
<li>做表面贴装技术（Surface Mount Technology， SMT ）设备的厂商</li>
<li>平板显示屏厂商</li>
<li>半导体产品测试设备厂商</li>
<li>半导体 MES 软件开发商</li>
</ul>

<p>
在SECS/GEM标准里，通信的双方又分为设备（ Equipment ）和主机（ Host ）。设备呢，包含制程生产设备、厂务设备、终端等。主机（ Host ）呢，一般就是工厂 IT 系统侧的 EAP 、MES、 CIM 等。
</p>

<p>
主机和设备之间都做哪些通讯呢？
</p>
<ul class="org-ul">
<li>远程设备通信和配置管理。GEM Semi-Bantu E30 部分用来处理这部分通信。包括数据采集，警报管理，设备配置，工艺上传下载，设备终端服务，本地远程控制等。</li>
<li>SEMI E84 和 E87 部分管理上下料系统，比如说什么时间要给哪个设备提供哪些物料。</li>
<li>SEMI E40 和 E94 处理任务管理。描述哪个设备在什么时间要处理哪些工艺。还要定义各个人物的物料清单和处理过程工艺。</li>
<li>SEMI E10 用于监控分析设备工作性能，提供预测性维护、预测性停机、故障警告的根因分析等。</li>
</ul>
